; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; USE CASE - 2 - Projection Aware Plan Execution
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain PAPE)

(:requirements :strips :typing)

(:types
block
)

(:predicates
(on ?x ?y - block)
(ontable ?x - block)
(clear ?x - block)
(holding ?x - block)
(handempty)
(isword ?b1 ?b2 ?b3 ?b4 - block)
(word-formed ?b1 ?b2 ?b3 ?b4 - block)
)

(:action makeword
:parameters (?b1 ?b2 ?b3 ?b4 - block)
:precondition
(and
(on ?b1 ?b2)
(on ?b2 ?b3)
(on ?b3 ?b4)
(ontable ?b4)
(clear ?b1)
(isword ?b1 ?b2 ?b3 ?b4)
)
:effect
(and
(word-formed ?b1 ?b2 ?b3 ?b4)
)
)

(:action pick-up
:parameters (?x - block)
:precondition
(and
(clear ?x)
(ontable ?x)
(handempty)
)
:effect
(and
(not (ontable ?x))
(not (clear ?x))
(not (handempty))
(holding ?x)
)
)

(:action put-down
:parameters (?x - block)
:precondition
(and
(holding ?x)
)
:effect
(and
(not (holding ?x))
(clear ?x)
(handempty)
(ontable ?x)
)
)

(:action stack
:parameters (?x ?y - block)
:precondition
(and
(holding ?x)
(clear ?y)
)
:effect
(and
(not (holding ?x))
(not (clear ?y))
(clear ?x)
(handempty)
(on ?x ?y)
)
)

(:action unstack
:parameters (?x ?y - block)
:precondition
(and
(on ?x ?y)
(clear ?x)
(handempty)
)
:effect
(and
(holding ?x)
(clear ?y)
(not (clear ?x))
(not (handempty))
(not (on ?x ?y))
)
)

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; USE CASE - 2 - Projection Aware Plan Execution
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem BRAT)

(:domain PAPE)

(:objects
A B G R O T - block
)

(:init
;; hand is empty
(handempty)
;; all blocks are clear
(clear A)
(clear B)
(clear G)
(clear O)
(clear R)
(clear T)
;; all blocks on the table
(ontable A)
(ontable B)
(ontable G)
(ontable O)
(ontable R)
(ontable T)
;; available words
(isword G O A T)
(isword B O A T)
(isword B R A T)
)

(:goal
(and
(word-formed B R A T)
)
)

)

; plan
1. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 0 of 1
2. (stack a t)
   deleted: (holding a) (clear t)
   added: (clear a) (handempty) (on a t)
   goals met: 0 of 1
3. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 0 of 1
4. (stack r a)
   deleted: (holding r) (clear a)
   added: (clear r) (handempty) (on r a)
   goals met: 0 of 1
5. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 0 of 1
6. (stack b r)
   deleted: (holding b) (clear r)
   added: (clear b) (handempty) (on b r)
   goals met: 0 of 1
7. (makeword b r a t)
   added: (word-formed b r a t)
   goals met: 1 of 1
